apache/nuttx/arch/arm/src/samv7/hardware/same70_pinmap.h
/************************************************************************************
 * arch/arm/src/samv7/hardware/same70_pinmap.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_SAMV7_HARDWARE_SAME70_PINMAP_H
#define __ARCH_ARM_SRC_SAMV7_HARDWARE_SAME70_PINMAP_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "sam_gpio.h"

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/* GPIO pin definitions *************************************************************/
/* Alternate Pin Functions
 *
 * These are mostly for reference and are not in pin configuration.
 */

#define GPIO_AFE0_AD0        (GPIO_ALTERNATE | GPIO_PORT_PIOD | GPIO_PIN30)
#define GPIO_AFE0_AD1        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN21)
#define GPIO_AFE0_AD2        (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN3)
#define GPIO_AFE0_AD3        (GPIO_ALTERNATE | GPIO_PORT_PIOE | GPIO_PIN5)
#define GPIO_AFE0_AD4        (GPIO_ALTERNATE | GPIO_PORT_PIOE | GPIO_PIN4)
#define GPIO_AFE0_AD5        (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN2)
#define GPIO_AFE0_AD6        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN17)
#define GPIO_AFE0_AD7        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN18)
#define GPIO_AFE0_AD8        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN19)
#define GPIO_AFE0_AD9        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN20)
#define GPIO_AFE0_AD10       (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN0)

#define GPIO_AFE1_AD0        (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN1)
#define GPIO_AFE1_AD1        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN13)
#define GPIO_AFE1_AD2        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN15)
#define GPIO_AFE1_AD3        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN12)
#define GPIO_AFE1_AD4        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN29)
#define GPIO_AFE1_AD5        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN30)
#define GPIO_AFE1_AD6        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN31)
#define GPIO_AFE1_AD7        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN26)
#define GPIO_AFE1_AD8        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN27)
#define GPIO_AFE1_AD9        (GPIO_ALTERNATE | GPIO_PORT_PIOC | GPIO_PIN0)
#define GPIO_AFE1_AD10       (GPIO_ALTERNATE | GPIO_PORT_PIOE | GPIO_PIN3)
#define GPIO_AFE1_AD11       (GPIO_ALTERNATE | GPIO_PORT_PIOE | GPIO_PIN0)

#define GPIO_DAC0            (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN13)
#define GPIO_DAC1            (GPIO_ALTERNATE | GPIO_PORT_PIOD | GPIO_PIN0)

#define GPIO_ERASE           (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN12)

#define GPIO_PIODC0          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN3)
#define GPIO_PIODC1          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN4)
#define GPIO_PIODC2          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN5)
#define GPIO_PIODC3          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN9)
#define GPIO_PIODC4          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN10)
#define GPIO_PIODC5          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN11)
#define GPIO_PIODC6          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN12)
#define GPIO_PIODC7          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN13)
#define GPIO_PIODCCLK        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN22)
#define GPIO_PIODCEN1        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN14)
#define GPIO_PIODCEN2        (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN21)

#define GPIO_RTCOUT0         (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN0)
#define GPIO_RTCOUT1         (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN1)

#define GPIO_SWCLK           (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN7)
#define GPIO_SWDIO           (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN6)
#define GPIO_TCK             (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN7)
#define GPIO_TDI             (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN4)
#define GPIO_TDO             (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN5)
#define GPIO_TMS             (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN6)
#define GPIO_TRACESWO        (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN5)

#define GPIO_WKUP0           (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN0)
#define GPIO_WKUP1           (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN1)
#define GPIO_WKUP2           (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN2)
#define GPIO_WKUP3           (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN4)
#define GPIO_WKUP4           (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN5)
#define GPIO_WKUP5           (GPIO_ALTERNATE | GPIO_PORT_PIOD | GPIO_PIN28)
#define GPIO_WKUP6           (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN9)
#define GPIO_WKUP7           (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN11)
#define GPIO_WKUP8           (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN14)
#define GPIO_WKUP9           (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN19)
#define GPIO_WKUP10          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN20)
#define GPIO_WKUP11          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN30)
#define GPIO_WKUP12          (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN3)
#define GPIO_WKUP13          (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN5)

#define GPIO_XIN             (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN9)
#define GPIO_XIN32           (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN7)
#define GPIO_XOUT            (GPIO_ALTERNATE | GPIO_PORT_PIOB | GPIO_PIN8)
#define GPIO_XOUT32          (GPIO_ALTERNATE | GPIO_PORT_PIOA | GPIO_PIN8)

/* Peripheral Pin Functions.
 *
 * Alternative pin selections are provided with a numeric suffix like _1, _2, etc.
 * Drivers, however, will use the pin selection without the numeric suffix.
 * Additional definitions are required in the board.h file.  For example, if we
 * wanted the UART1 TX output PCK0 on PA4, then the following definition
 * should appear in the board.h header file for that board:
 *
 * #define GPIO_UART1_TXD GPIO_UART1_TXD_1
 *
 * The driver will then automatically configure PA6 as the PCK0 pin.
 */

/* WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!!
 * Additional effort is required to select specific GPIO options such as frequency,
 * open-drain/push-pull, and pull-up/down!  Just the basics are defined for most
 * pins in this file.
 */

/* Analog Front End (AFE) */

#define GPIO_AFE0_ADTRG      (GPIO_PERIPHB | GPIO_CFG_DEFAULT | GPIO_PORT_PIOA | GPIO_PIN8)
#define GPIO_AFE1_ADTRG      (GPIO_PERIPHC | GPIO_CFG_DEFAULT | GPIO_PORT_PIOD | GPIO_PIN9)

/* MCAN */

#define GPIO_MCAN0_RX        (GPIO_PERIPHA | GPIO_CFG_DEFAULT | GPIO_PORT_PIOB | GPIO_PIN3)
#define GPIO_MCAN0_TX        (GPIO_PERIPHA | GPIO_CFG_DEFAULT | GPIO_PORT_PIOB | GPIO_PIN2)
#define GPIO_MCAN1_RX_1      (GPIO_PERIPHB | GPIO_CFG_DEFAULT | GPIO_PORT_PIOD | GPIO_PIN28)
#define GPIO_MCAN1_RX_2      (GPIO_PERIPHC | GPIO_CFG_DEFAULT | GPIO_PORT_PIOC | GPIO_PIN12)
#define GPIO_MCAN1_TX_1      (GPIO_PERIPHB | GPIO_CFG_DEFAULT | GPIO_PORT_PIOD | GPIO_PIN12)
#define GPIO_MCAN1_TX_2      (GPIO_PERIPHC | GPIO_CFG_DEFAULT | GPIO_PORT_PIOC | GPIO_PIN14)

